// © Copyright 2004-2007, 2015 HP Development Company, L.P.

TaskName = "上载字体";

OkButtonTitle = "确定";
CancelButtonTitle = "取消";
LoadingStorageDeviceInfoProcessTitle = "正在加载存储设备信息...";
LoadingStorageDeviceListProcessTitle = "正在加载存储设备列表...";
LoadingFontListProcessTitle = "正在加载字体列表...";
SendingFontProcessTitle = "正在上载字体“%@”...";
RemovingFontProcessTitle = "正在删除字体“%@”...";
RemoveConfirmationMessage = "确实要从打印机中删除所选字体吗？";
RemoveConfirmationMessageExplanation = "您无法撤消此项操作。";
StorageDeviceLocked = "存储设备已锁定";
RemoveFromMemoryMessage = "无法从设备内存删除字体";
RemoveFromMemoryExplanation = "所有预安装的字体都为只读属性。当设备重新启动时，将从内存中删除用户添加的所有字体。在重新启动过程中会保存位于其他存储设备上的字体，并且这些字体可以手动删除。";

DiskNameTemplate = "磁盘，ID=%@ (大小：%@)";
FlashNameTemplate = "Flash SIMM，ID=%@ (大小：%@)";
SizeInBytes = "%.1f 字节";
SizeInKBytes = "%.1f KB";
SizeInMBytes = "%.1f MB";
SizeInGBytes = "%.1f GB";
SizeInTBytes = "%.1f TB";

// Errors
FileOpenError = "无法打开“%@”字体文件。";
FileOpenErrorExplanation = "此文件已损坏，或者不支持其格式。请选择另一个字体文件并重试。";
FormatError = "无法识别“%@”字体格式。";
FormatErrorExplanation = "请选择另一个字体文件并重试。";
SingleUnsupportedError = "字体“%@”不受支持。";
SingleUnsupportedErrorExplanation = "将跳过此字体。";
MultipleUnsupportedError = "字体 %@ 不受支持。";
MultipleUnsupportedErrorExplanation = "将跳过这些字体。";
SingleAlreadyScheduledError = "列表中已存在“%@”字体。";
SingleAlreadyScheduledErrorExplanation = "将跳过该字体。";
MultipleAlreadyScheduledError = "字体 %@ 已存在于列表内。";
MultipleAlreadyScheduledErrorExplanation = "将跳过这些字体。";
SingleAlreadyUploadedError = "打印机上已存在“%@”字体。";
SingleAlreadyUploadedErrorExplanation = "将跳过该字体。";
MultipleAlreadyUploadedError = "字体 %@ 已存在于打印机上。";
MultipleAlreadyUploadedErrorExplanation = "将跳过这些字体。";
PrintChannelOpenError = "无法打开打印机通道。";
PrintChannelOpenErrorExplanation = "请检查打印机是否已连接并开启，然后重试。";
DataSendError = "无法将数据发送到打印机。";
DataSendErrorExplanation = "请检查打印机是否已连接并开启，然后重试。";
DataReceiveError = "无法接收来自打印机的数据。";
DataReceiveErrorExplanation = "请检查打印机是否已连接并开启，然后重试。";
FontSendError = "无法将“%@”字体数据发送到打印机。";
FontSendErrorExplanation = "请检查打印机是否已连接并开启。请注意：字体列表中的剩余字体尚未发送到打印机中。";
FontRemoveError = "无法从打印机删除“%@”字体。";
FontRemoveErrorExplanation = "请检查打印机是否已连接并开启。请注意：字体列表中的剩余字体尚未从打印机中删除。";
StorageDeviceFullError = "因为存储设备已满，所以无法上载“%@”字体。";
StorageDeviceFullErrorExplanation = "请选择其他存储设备或删除一些不用的字体，然后重试。请注意：字体列表中的剩余字体尚未上载到打印机中。";
ScriptProcessingError = "无法处理使用“%@”字体的脚本。";
ScriptProcessingErrorExplanation = "请选择其他字体，然后重试。请注意：字体列表中的剩余字体尚未上载到打印机中。";
DeviceVmError = "因为打印机内存不足，所以无法上载“%@”字体。";
DeviceVmErrorExplanation = "请选择其他存储设备或删除一些不用的字体，然后重试。请注意：字体列表中的剩余字体尚未上载到打印机中。";

DeviceBusyErrorTitle = "设备当前正忙。";
DeviceBusyErrorMessage = "请等候设备完成其当前作业。";

FontNameTemplate = "\"%@\"";

Memory = "内存";
UpdateNeeded = "需要更新";

TaskTitle = "上载字体";
TaskDescription = "选择包含打印机字体的文件并将其传送至打印机。之后，所传送的字体即将应用于打印作业中。";
StorageDevices = "打印机中的字体：";
UpdateButton = "更新字体列表";
RemoveButton = "删除";
AddButton = "添加…";
